_posts/a.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-07 Sun 21:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bo Xia" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7d1c8c3">1. grub启动器介绍</a>
<ul>
<li><a href="#org43fe2c9">1.1. grub启动界面常用命令</a></li>
<li><a href="#org3fc2792">1.2. grub设备命令约定</a></li>
<li><a href="#org4327cd7">1.3. grub命令行界面常用命令</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7d1c8c3" class="outline-2">
<h2 id="org7d1c8c3"><span class="section-number-2">1</span> grub启动器介绍</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>GRand Unified Bootloader</li>
<li><i>bootloader</i>: 电脑启动后第一个运行的软件程序，加载操作系统内核,并把<br />
控制权交给内核。eg. LILO ,grub, windows loader</li>
</ul>
</div>
<div id="outline-container-org43fe2c9" class="outline-3">
<h3 id="org43fe2c9"><span class="section-number-3">1.1</span> grub启动界面常用命令</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>e 进入编缉界面</li>
<li>c 进入grub命令行交互界面</li>
<li>上面方向键选择启动项</li>
<li>任何界面可使用esc退回到主界面</li>
</ul>
</div>
</div>
<div id="outline-container-org3fc2792" class="outline-3">
<h3 id="org3fc2792"><span class="section-number-3">1.2</span> grub设备命令约定</h3>
<div class="outline-text-3" id="text-1-2">
<p>
grub使用的命令约定与linux系统使用的稍有不同。 linux 使用sda,sda1,hda<br />
,hda1,vda,vda1之类的格式来命令硬盘或分区,grub使用（hd0,gpt1)<br />
这样的格式来命名硬盘或分区
</p>
<ul class="org-ul">
<li>设备名用()括起来</li>
<li>hd表式硬盘,fd表示软盘</li>
<li>硬盘驱动从0开始编号</li>
<li>msdos表示传统分区，gpt表标gpt分区</li>
<li>分区编号从1开始，如果有扩展分区，扩展分区从5开始计数。</li>
<li>可省略分区，表示整块盘。</li>
<li>eg. (fd0) =&gt; 整块软盘， (hd0, msdos2) =&gt; 第一块硬盘的第二个传统分区，<br />
（hd2,gpt3) =&gt; 第三块硬盘的第三个gpt分区， （hd0, msdos5) =&gt; 第一块 <br />
硬盘的第一个扩展分区。</li>
</ul>
</div>
</div>
<div id="outline-container-org4327cd7" class="outline-3">
<h3 id="org4327cd7"><span class="section-number-3">1.3</span> grub命令行界面常用命令</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>我们的好朋友TAB键，TAB可以自动补全信息，包括命令补全，文件补全</li>
<li>cat：查看文件内容与linux中的cat相似</li>
<li>set: 设置变量值，例：set root=(hd0, lvm/os-root)</li>
<li>insmod: 使用insmod modulename加一个模块 常用的模块包括xfs, gzio,<br />
<span class="underline">lvm</span>.</li>
<li>linux16: 加载linux内核文件 linux16 pathtokernel arg1=value1 &#x2026;</li>
<li>initrd16: 加载initramfs initrd16 pathtoranfs</li>
<li>boot：启动操作系统</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Bo Xia</p>
<p class="date">Created: 2019-04-07 Sun 21:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
